// 计算a^n % mod 快速幂
int qpow(int a, long long n, int mod) 
{
  int ans = 1;
  int base = a;
  while (n > 0) {
    if (n & 1) // 找到n的二进制的哪些位子是1
    {
      ans = ans * (long long)base % mod; // 有1，则说明这个位子对应的a的k次方要进行*=
    }
    base = (long long)base * base % mod; // 快速幂的自我叠加相乘
    n >>= 1; // 下一次while循环查找下一位二进制
  }
  return ans;
}

/*快速幂的原理：计算5^n
eg：计算5^64
一般计算：循环64次
快速幂：5*5=5^2
        5^2*5^2=5^4
        5^4*5^4=5^8
		5^8*5^8=5^16 
		5^16*5^16=5^32
		5^32*5^32=5^64
		只要循环6次（2^6==64)
		==》叠加相乘
但计算5^105次方咋办？
105==1+8+32+64
只要增加一步：5 * 5^8 * 5^32 * 5^64 ==5^105即可
==》那关键在于：如何找到 n是哪些2^k之和？
==》位运算：105== 1 1 0 1 0 0 1
            64==  1 0 0 0 0 0 0
            32==  0 1 0 0 0 0 0
            8==   0 0 0 1 0 0 0
            1==   0 0 0 0 0 0 1
 也就是找出所有的“1”*/